app/controllers/restaurants_controller.rb

  def create
    @restaurant = Restaurant.new(restaurant_params)
    @restaurant.user_id = current_user.id
    if @restaurant.save
---
INSERT INTO "restaurants" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Burger King"], ["user_id", 1], ["created_at", "2016-03-04 11:05:06.835645"], ["updated_at", "2016-03-04 11:05:06.835645"]]

  def edit
    @restaurant = Restaurant.find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @restaurant = Restaurant.find(params[:id])
    @restaurant.update(restaurant_params)
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "restaurants" SET "name" = $1, "updated_at" = $2 WHERE "restaurants"."id" = $3  [["name", "KFC"], ["updated_at", "2016-03-01 19:48:27.500493"], ["id", 1]]

  def destroy
    @restaurant = Restaurant.find(params[:id])
    if @restaurant.user_id == current_user.id
      @restaurant.destroy
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = $1  [["id", 1]]