app/controllers/reviews_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 1]]
---
  def new
    @restaurant = Restaurant.find(params[:restaurant_id])

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "reviews" ("thoughts", "rating", "user_id", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["thoughts", "Do tasty hash browns."], ["rating", 3], ["user_id", 1], ["restaurant_id", 2], ["created_at", "2016-03-04 11:02:34.520400"], ["updated_at", "2016-03-04 11:02:34.520400"]]
---
  def create
    @restaurant = Restaurant.find(params[:restaurant_id])
    @review = @restaurant.build_review review_params, current_user

    if @review.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT 1  [["id", 4]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 4]]
---
  def destroy
    @review = Review.find(params[:id])
    if @review.user_id == current_user.id
      @review.destroy